ljun3498-oss/stm32/User/main.c
#include "stm32f10x.h"
#include "delay.h"
#include "OLED.H"
#include <stddef.h>

/* ==================== Global Variables ==================== */

// PWM Module Constants
#define PWM_FREQ_KHZ       20
#define PWM_TIMER_CLK_HZ   72000000
#define PWM_CENTER_ALIGNED 1
#if PWM_CENTER_ALIGNED
#define PWM_PERIOD_TICKS   ((PWM_TIMER_CLK_HZ / (PWM_FREQ_KHZ * 1000U * 2U)) - 1U)
#else
#define PWM_PERIOD_TICKS   ((PWM_TIMER_CLK_HZ / (PWM_FREQ_KHZ * 1000U)) - 1U)
#endif
#define PWM_PERIOD_TOTAL   (PWM_PERIOD_TICKS + 1U)

// ADC Module Constants
#define ADC_SAMPLE_RATE_HZ     10000U
#define ADC_TIMER_CLK_HZ       72000000U

// Encoder Module Constants
#define MT6701_I2C_ADDR        0x06
#define MT6701_REG_ANGLE_MSB   0x03
#define MT6701_ELEC_COUNTS     16384
#define MT6701_POLE_PAIRS      7          // 电机极对数：7对
#define MT6701_MECH_COUNTS     (MT6701_ELEC_COUNTS * 4)  // 机械计数 = 编码器4圈 = 电机1圈（4:1传动比）
#define BUFFER_SIZE            32

// FOC Module Constants
#define Q15_SCALE       32768
#define Q15_MULT(a, b)  ((int32_t)(a) * (int32_t)(b) >> 15)
#define ANGLE_MAX       65536
#define DEG_TO_ANGLE(deg)  ((uint16_t)((deg) * 65536L / 360))
#define BUS_VOLTAGE_MV  12000        // 母线电压 12V
#define MAX_CURRENT_MA  1500         // 额定电流 1.5A
#define MAX_CURRENT_Q15 32767        // 1.5A对应的Q15值（最大值）
#define ELEC_ALIGN_SHIFT_TENTHS 0    // 电角度固定偏移(0.1度)，默认0，交由对齐计算
#define ELEC_ANGLE_DIR  -1           // 电角度方向: 1=正向, -1=反向
#define KP_ID_Q15       1638         // Kp=0.05 * 32768 (降低响应防止震荡)
#define KI_ID_Q15       50           // Ki降低
#define KP_IQ_Q15       1638         // Kp=0.05 (降低防止震荡)
#define KI_IQ_Q15       50           // Ki降低
#define DT_MS           0.1          // 实际控制周期100µs (10kHz)
#define FOC_ISR_HZ      ADC_SAMPLE_RATE_HZ
#define ALIGNMENT_SAMPLES (FOC_ISR_HZ / 1U)  // 1s (加强对齐时间)
#define VOLT_MAX_Q15    26214        // 0.8 in Q15
#define OPEN_LOOP_TEST  0            // 1=开环测试, 0=闭环FOC
#define OPEN_LOOP_VD_Q15 0
#define OPEN_LOOP_VQ_Q15 8000        // 开环q轴电压(归一化0.244，实际约2.93V)
#define OPEN_LOOP_STEP_Q16 100      // 电角度步进(20kHz下约3138rpm机械)

// Sin/Cos查找表（256点，Q15格式）
static const int16_t sin_table[256] = {
    0, 804, 1608, 2410, 3212, 4011, 4808, 5602, 6393, 7179, 7962, 8739, 9512, 10278, 11039, 11793,
    12539, 13279, 14010, 14732, 15446, 16151, 16846, 17530, 18204, 18868, 19519, 20159, 20787, 21403, 22005, 22594,
    23170, 23731, 24279, 24811, 25329, 25832, 26319, 26790, 27245, 27683, 28105, 28510, 28898, 29268, 29621, 29956,
    30273, 30571, 30852, 31113, 31356, 31580, 31785, 31971, 32137, 32285, 32412, 32521, 32609, 32678, 32728, 32757,
    32767, 32757, 32728, 32678, 32609, 32521, 32412, 32285, 32137, 31971, 31785, 31580, 31356, 31113, 30852, 30571,
    30273, 29956, 29621, 29268, 28898, 28510, 28105, 27683, 27245, 26790, 26319, 25832, 25329, 24811, 24279, 23731,
    23170, 22594, 22005, 21403, 20787, 20159, 19519, 18868, 18204, 17530, 16846, 16151, 15446, 14732, 14010, 13279,
    12539, 11793, 11039, 10278, 9512, 8739, 7962, 7179, 6393, 5602, 4808, 4011, 3212, 2410, 1608, 804,
    0, -804, -1608, -2410, -3212, -4011, -4808, -5602, -6393, -7179, -7962, -8739, -9512, -10278, -11039, -11793,
    -12539, -13279, -14010, -14732, -15446, -16151, -16846, -17530, -18204, -18868, -19519, -20159, -20787, -21403, -22005, -22594,
    -23170, -23731, -24279, -24811, -25329, -25832, -26319, -26790, -27245, -27683, -28105, -28510, -28898, -29268, -29621, -29956,
    -30273, -30571, -30852, -31113, -31356, -31580, -31785, -31971, -32137, -32285, -32412, -32521, -32609, -32678, -32728, -32757,
    -32767, -32757, -32728, -32678, -32609, -32521, -32412, -32285, -32137, -31971, -31785, -31580, -31356, -31113, -30852, -30571,
    -30273, -29956, -29621, -29268, -28898, -28510, -28105, -27683, -27245, -26790, -26319, -25832, -25329, -24811, -24279, -23731,
    -23170, -22594, -22005, -21403, -20787, -20159, -19519, -18868, -18204, -17530, -16846, -16151, -15446, -14732, -14010, -13279,
    -12539, -11793, -11039, -10278, -9512, -8739, -7962, -7179, -6393, -5602, -4808, -4011, -3212, -2410, -1608, -804
};

// ADC Module
uint16_t AD_Value[3];
static uint16_t g_adc_zero_offset[3] = {2048, 2048, 2048};  // 默认2.5V为中点

// Encoder Module (non-buffer variables)
static volatile uint32_t g_ms = 0;
static uint16_t g_last_raw = 0;
static int32_t g_accum = 0;
static int32_t g_last_speed_accum = 0;
static uint32_t g_last_speed_time = 0;
static volatile int16_t g_current_rpm = 0;
static volatile uint8_t g_dma_active = 0;

// Encoder Module (buffer variables)
static uint8_t g_buffer0[BUFFER_SIZE * 2];
static uint8_t g_buffer1[BUFFER_SIZE * 2];
static uint8_t *g_active_buffer = g_buffer0;
static uint8_t *g_ready_buffer = NULL;
static volatile uint16_t g_buffer_index = 0;
static volatile uint8_t g_buffer_ready = 0;

// 编码器原始值缓存（在读取失败时使用）
static uint16_t encoder_raw_cache = 0;
static uint16_t diag_raw_value = 0;  // 诊断用：当前raw值
static uint16_t diag_last_raw = 0;   // 诊断用：g_last_raw值
static uint16_t diag_init_val = 0;   // 诊断用：初始化时的值
static volatile uint16_t g_encoder_raw_for_foc = 0;  // 供FOC中断用的编码器原始值(14bit)

// 三相电流显示变量
static volatile int16_t g_Ia_mA = 0;
static volatile int16_t g_Ib_mA = 0;
static volatile int16_t g_Ic_mA = 0;

// FOC Module
#define FOC_STATE_IDLE       0   // 空闲，PWM输出0
#define FOC_STATE_ALIGN      1   // 对齐模式，锁定转子到d轴
#define FOC_STATE_OPENLOOP   2   // 开环模式，验证方向和极对数
#define FOC_STATE_CLOSEDLOOP 3   // 闭环FOC模式

static uint16_t g_cached_angle_tenths = 0;  // 缓存当前编码器角度
static volatile uint8_t g_alignment_done = 0;  // 对齐完成标志
static volatile uint8_t g_oled_update_flag = 0;
static volatile uint8_t g_foc_enabled = 0;
static volatile uint8_t g_foc_state = FOC_STATE_IDLE;  // FOC状态机
static volatile uint8_t g_theta_flip = 1;  // 电角度方向翻转（1=反向）
static volatile uint32_t g_align_counter = 0;    // 对齐计数器
static int16_t g_elec_offset_q16 = 0;            // 对齐电角度偏移 (Q16格式)
static int16_t g_iq_ref_q15 = 0;                 // q轴电流参考 (Q15格式)
static volatile uint16_t g_open_loop_theta = 0;  // 开环电角度（软件步进）

// FOC PI Controllers
static int32_t Id_int_q15 = 0;
static int32_t Iq_int_q15 = 0;

// OLED Display Variables
static uint16_t display_counter = 0;

/* ==================== PWM Module ==================== */

static void PWM_InitGPIO(void)
{
    RCC_APB2PeriphClockCmd(RCC_APB2Periph_GPIOA, ENABLE);

    GPIO_InitTypeDef GPIO_InitStructure;
    GPIO_InitStructure.GPIO_Mode = GPIO_Mode_AF_PP;
    GPIO_InitStructure.GPIO_Speed = GPIO_Speed_50MHz;
    GPIO_InitStructure.GPIO_Pin = GPIO_Pin_0 | GPIO_Pin_1 | GPIO_Pin_2;
    GPIO_Init(GPIOA, &GPIO_InitStructure);
}

static void PWM_InitTimeBase(TIM_TypeDef *TIMx)
{
    TIM_InternalClockConfig(TIMx);

    TIM_TimeBaseInitTypeDef TIM_TimeBaseInitStructure;
    TIM_TimeBaseInitStructure.TIM_ClockDivision = TIM_CKD_DIV1;
    TIM_TimeBaseInitStructure.TIM_CounterMode = TIM_CounterMode_CenterAligned1;
    TIM_TimeBaseInitStructure.TIM_Period = PWM_PERIOD_TICKS;
    TIM_TimeBaseInitStructure.TIM_Prescaler = 0;
    TIM_TimeBaseInitStructure.TIM_RepetitionCounter = 0;
    TIM_TimeBaseInit(TIMx, &TIM_TimeBaseInitStructure);
}

static void PWM_InitOC123(TIM_TypeDef *TIMx)
{
    TIM_OCInitTypeDef TIM_OCInitStructure;
    TIM_OCStructInit(&TIM_OCInitStructure);
    TIM_OCInitStructure.TIM_OCMode = TIM_OCMode_PWM1;
    TIM_OCInitStructure.TIM_OCPolarity = TIM_OCPolarity_High;
    TIM_OCInitStructure.TIM_OutputState = TIM_OutputState_Enable;
    TIM_OCInitStructure.TIM_Pulse = 0;
    TIM_OC1Init(TIMx, &TIM_OCInitStructure);
    TIM_OC2Init(TIMx, &TIM_OCInitStructure);
    TIM_OC3Init(TIMx, &TIM_OCInitStructure);
}

void PWM_Init(void)
{
    RCC_APB1PeriphClockCmd(RCC_APB1Periph_TIM2, ENABLE);

