ljun3498-oss/stm32/User/main.c
    PWM_InitGPIO();
    PWM_InitTimeBase(TIM2);
    PWM_InitOC123(TIM2);

    // 初始化PWM为0，防止上电时电机意外转动
    TIM_SetCompare1(TIM2, 0);
    TIM_SetCompare2(TIM2, 0);
    TIM_SetCompare3(TIM2, 0);

    // 配置TIM2更新中断（最高优先级，用于FOC控制环 @ 20kHz）
    TIM_ITConfig(TIM2, TIM_IT_Update, ENABLE);
    {
        NVIC_InitTypeDef NVIC_InitStructure;
        NVIC_InitStructure.NVIC_IRQChannel = TIM2_IRQn;
        NVIC_InitStructure.NVIC_IRQChannelPreemptionPriority = 0;  // 最高抢占优先级
        NVIC_InitStructure.NVIC_IRQChannelSubPriority = 0;
        NVIC_InitStructure.NVIC_IRQChannelCmd = ENABLE;
        NVIC_Init(&NVIC_InitStructure);
    }

    TIM_Cmd(TIM2, ENABLE);
}

void PWM_Setcompare1(uint16_t Compare) { TIM_SetCompare1(TIM2, Compare); }
void PWM_Setcompare2(uint16_t Compare) { TIM_SetCompare2(TIM2, Compare); }
void PWM_Setcompare3(uint16_t Compare) { TIM_SetCompare3(TIM2, Compare); }

/* ==================== ADC Module ==================== */
uint16_t AD_Value[3];

static void DMAAD_TimerTriggerInit(void)
{
    RCC_APB1PeriphClockCmd(RCC_APB1Periph_TIM3, ENABLE);

    TIM_TimeBaseInitTypeDef TIM_TimeBaseInitStructure;
    TIM_TimeBaseInitStructure.TIM_ClockDivision = TIM_CKD_DIV1;
    TIM_TimeBaseInitStructure.TIM_CounterMode = TIM_CounterMode_Up;
    TIM_TimeBaseInitStructure.TIM_Period = (ADC_TIMER_CLK_HZ / ADC_SAMPLE_RATE_HZ) - 1U;
    TIM_TimeBaseInitStructure.TIM_Prescaler = 0;
    TIM_TimeBaseInitStructure.TIM_RepetitionCounter = 0;
    TIM_TimeBaseInit(TIM3, &TIM_TimeBaseInitStructure);

    TIM_SelectOutputTrigger(TIM3, TIM_TRGOSource_Update);
    // 暂不配置同步模式，TIM3独立运行以保证ADC采样稳定
    // (同步配置可以后续优化，但不应该破坏采样)
    
    // 配置TIM3中断用于FOC电流环（初始禁用，按键启动后才启用）
    TIM_ITConfig(TIM3, TIM_IT_Update, DISABLE);
    
    NVIC_InitTypeDef NVIC_InitStructure;
    NVIC_InitStructure.NVIC_IRQChannel = TIM3_IRQn;
    NVIC_InitStructure.NVIC_IRQChannelPreemptionPriority = 2;
    NVIC_InitStructure.NVIC_IRQChannelSubPriority = 0;
    NVIC_InitStructure.NVIC_IRQChannelCmd = ENABLE;
    NVIC_Init(&NVIC_InitStructure);
    
    // 启用TIM3计数器，使其开始运行
    TIM_Cmd(TIM3, ENABLE);
}

void DMAAD_Init(void)
{
    RCC_APB2PeriphClockCmd(RCC_APB2Periph_ADC1, ENABLE);
    RCC_APB2PeriphClockCmd(RCC_APB2Periph_GPIOA, ENABLE);
    RCC_AHBPeriphClockCmd(RCC_AHBPeriph_DMA1, ENABLE);
    
    RCC_ADCCLKConfig(RCC_PCLK2_Div6);
    
    GPIO_InitTypeDef GPIO_InitStructure;
    GPIO_InitStructure.GPIO_Mode = GPIO_Mode_AIN;
    GPIO_InitStructure.GPIO_Pin = GPIO_Pin_5 | GPIO_Pin_6 | GPIO_Pin_7;
    GPIO_InitStructure.GPIO_Speed = GPIO_Speed_50MHz;
    GPIO_Init(GPIOA, &GPIO_InitStructure);
    
    // 先初始化 DMA
    DMA_InitTypeDef DMA_InitStructure;
    DMA_DeInit(DMA1_Channel1);
    DMA_InitStructure.DMA_BufferSize = 3;
    DMA_InitStructure.DMA_DIR = DMA_DIR_PeripheralSRC;
    DMA_InitStructure.DMA_M2M = DISABLE;
    DMA_InitStructure.DMA_Mode = DMA_Mode_Circular;
    DMA_InitStructure.DMA_Priority = DMA_Priority_Medium;
    DMA_InitStructure.DMA_MemoryBaseAddr = (uint32_t)AD_Value;
    DMA_InitStructure.DMA_MemoryDataSize = DMA_MemoryDataSize_HalfWord;
    DMA_InitStructure.DMA_MemoryInc = DMA_MemoryInc_Enable;
    DMA_InitStructure.DMA_PeripheralBaseAddr = (uint32_t)&ADC1->DR;
    DMA_InitStructure.DMA_PeripheralDataSize = DMA_PeripheralDataSize_HalfWord;
    DMA_InitStructure.DMA_PeripheralInc = DMA_PeripheralInc_Disable;
    DMA_Init(DMA1_Channel1, &DMA_InitStructure);
    DMA_Cmd(DMA1_Channel1, ENABLE);
    
    // 初始化 ADC
    ADC_DeInit(ADC1);
    ADC_InitTypeDef ADC_InitStructure;
    ADC_InitStructure.ADC_Mode = ADC_Mode_Independent;
    ADC_InitStructure.ADC_ScanConvMode = ENABLE;
    ADC_InitStructure.ADC_ContinuousConvMode = ENABLE;
    ADC_InitStructure.ADC_ExternalTrigConv = ADC_ExternalTrigConv_None;  // 改为软件触发
    ADC_InitStructure.ADC_DataAlign = ADC_DataAlign_Right;
    ADC_InitStructure.ADC_NbrOfChannel = 3;
    ADC_Init(ADC1, &ADC_InitStructure);
    
    // 配置3个通道的扫描序列
    // 缩短采样时间：13.5周期（约2.5μs/通道，3通道总耗时<8μs）
    ADC_RegularChannelConfig(ADC1, ADC_Channel_5, 1, ADC_SampleTime_13Cycles5);
    ADC_RegularChannelConfig(ADC1, ADC_Channel_6, 2, ADC_SampleTime_13Cycles5);
    ADC_RegularChannelConfig(ADC1, ADC_Channel_7, 3, ADC_SampleTime_13Cycles5);
    
    // 启用 DMA 和 ADC
    ADC_DMACmd(ADC1, ENABLE);
    ADC_Cmd(ADC1, ENABLE);
    
    // ADC 校准
    ADC_ResetCalibration(ADC1);
    while (ADC_GetResetCalibrationStatus(ADC1) == SET);
    ADC_StartCalibration(ADC1);
    while (ADC_GetCalibrationStatus(ADC1) == SET);
    
    // 初始化定时器触发
    DMAAD_TimerTriggerInit();

    // 启动连续转换（DMA会持续更新AD_Value）
    ADC_SoftwareStartConvCmd(ADC1, ENABLE);
    
    // ADC 预热延迟，让 DMA 先收集几个采样点稳定数据
    Delay_ms(200);
}

// ADC零漂补偿（上电时校准）

void DMAAD_CalibrateZeroPoint(void)
{
    // 采用软件触发采样，计算真实零点（电机静止、无负载）
    uint32_t accum[3] = {0, 0, 0};
    uint16_t i;

    for (i = 0; i < 128; i++)
    {
        ADC_SoftwareStartConvCmd(ADC1, ENABLE);
        Delay_ms(1);
        accum[0] += AD_Value[0];
        accum[1] += AD_Value[1];
        accum[2] += AD_Value[2];
    }

    g_adc_zero_offset[0] = (uint16_t)(accum[0] >> 7);
    g_adc_zero_offset[1] = (uint16_t)(accum[1] >> 7);
    g_adc_zero_offset[2] = (uint16_t)(accum[2] >> 7);
}

int32_t DMAAD_AdcToCurrent_mA(uint16_t adc, uint8_t channel)
{
    // 使用校准的零点进行转换
    int16_t adc_zero = (int16_t)g_adc_zero_offset[channel];
    int16_t adc_delta = (int16_t)adc - adc_zero;  // 相对于零点的偏移
    
    // ADC转电压：delta再转电流
    int32_t delta_mv = (int32_t)adc_delta * 3300 / 4095;
    return (delta_mv * 1000) / 185;  // 185mΩ采样电阻
}

/* ==================== Encoder Module ==================== */

void TIM4_IRQHandler(void)
{
    if (TIM_GetITStatus(TIM4, TIM_IT_Update) == SET)
    {
        g_ms++;
        TIM_ClearITPendingBit(TIM4, TIM_IT_Update);
    }
}

void DMA1_Channel5_IRQHandler(void)
{
    if (DMA_GetITStatus(DMA1_IT_TC5))
    {
        DMA_ClearITPendingBit(DMA1_IT_TC5);

        I2C_GenerateSTOP(I2C2, ENABLE);
        DMA_Cmd(DMA1_Channel5, DISABLE);
        I2C_DMACmd(I2C2, DISABLE);

        g_buffer_index++;
        if (g_buffer_index >= BUFFER_SIZE)
        {
            g_buffer_ready = 1;
            g_ready_buffer = g_active_buffer;
            g_active_buffer = (g_active_buffer == g_buffer0) ? g_buffer1 : g_buffer0;
            g_buffer_index = 0;
        }

