ljun3498-oss/stm32/User/main.c
        DMA_SetCurrDataCounter(DMA1_Channel5, 2);
        DMA1_Channel5->CMAR = (uint32_t)(g_active_buffer + g_buffer_index * 2);

        I2C_GenerateSTART(I2C2, ENABLE);
        uint32_t timeout = 1000;
        while (!I2C_CheckEvent(I2C2, I2C_EVENT_MASTER_MODE_SELECT) && timeout > 0) { timeout--; }

        I2C_Send7bitAddress(I2C2, MT6701_I2C_ADDR << 1, I2C_Direction_Transmitter);
        timeout = 1000;
        while (!I2C_CheckEvent(I2C2, I2C_EVENT_MASTER_TRANSMITTER_MODE_SELECTED) && timeout > 0) { timeout--; }

        I2C_SendData(I2C2, MT6701_REG_ANGLE_MSB);
        timeout = 1000;
        while (!I2C_CheckEvent(I2C2, I2C_EVENT_MASTER_BYTE_TRANSMITTED) && timeout > 0) { timeout--; }

        I2C_GenerateSTART(I2C2, ENABLE);
        timeout = 1000;
        while (!I2C_CheckEvent(I2C2, I2C_EVENT_MASTER_MODE_SELECT) && timeout > 0) { timeout--; }

        I2C_Send7bitAddress(I2C2, MT6701_I2C_ADDR << 1, I2C_Direction_Receiver);
        timeout = 1000;
        while (!I2C_CheckEvent(I2C2, I2C_EVENT_MASTER_RECEIVER_MODE_SELECTED) && timeout > 0) { timeout--; }

        I2C_DMALastTransferCmd(I2C2, ENABLE);
        I2C_DMACmd(I2C2, ENABLE);
        DMA_Cmd(DMA1_Channel5, ENABLE);
    }
}

static void Encoder_TimeBaseInit(void)
{
    RCC_APB1PeriphClockCmd(RCC_APB1Periph_TIM4, ENABLE);

    TIM_TimeBaseInitTypeDef TIM_TimeBaseInitStructure;
    TIM_TimeBaseInitStructure.TIM_ClockDivision = TIM_CKD_DIV1;
    TIM_TimeBaseInitStructure.TIM_CounterMode = TIM_CounterMode_Up;
    TIM_TimeBaseInitStructure.TIM_Prescaler = 7200 - 1;
    TIM_TimeBaseInitStructure.TIM_Period = 100 - 1;
    TIM_TimeBaseInitStructure.TIM_RepetitionCounter = 0;
    TIM_TimeBaseInit(TIM4, &TIM_TimeBaseInitStructure);

    TIM_ITConfig(TIM4, TIM_IT_Update, ENABLE);

    NVIC_InitTypeDef NVIC_InitStructure;
    NVIC_InitStructure.NVIC_IRQChannel = TIM4_IRQn;
    NVIC_InitStructure.NVIC_IRQChannelCmd = ENABLE;
    NVIC_InitStructure.NVIC_IRQChannelPreemptionPriority = 3;  // 最低优先级（通用计时）
    NVIC_InitStructure.NVIC_IRQChannelSubPriority = 0;
    NVIC_Init(&NVIC_InitStructure);

    TIM_Cmd(TIM4, ENABLE);
}

static void Encoder_DMA_Init(void)
{
    DMA_InitTypeDef DMA_InitStructure;

    RCC_AHBPeriphClockCmd(RCC_AHBPeriph_DMA1, ENABLE);

    DMA_DeInit(DMA1_Channel5);

    DMA_InitStructure.DMA_PeripheralBaseAddr = (uint32_t)&(I2C2->DR);
    DMA_InitStructure.DMA_MemoryBaseAddr = (uint32_t)g_active_buffer;
    DMA_InitStructure.DMA_DIR = DMA_DIR_PeripheralSRC;
    DMA_InitStructure.DMA_BufferSize = 2;
    DMA_InitStructure.DMA_PeripheralInc = DMA_PeripheralInc_Disable;
    DMA_InitStructure.DMA_MemoryInc = DMA_MemoryInc_Enable;
    DMA_InitStructure.DMA_PeripheralDataSize = DMA_PeripheralDataSize_Byte;
    DMA_InitStructure.DMA_MemoryDataSize = DMA_MemoryDataSize_Byte;
    DMA_InitStructure.DMA_Mode = DMA_Mode_Normal;
    DMA_InitStructure.DMA_Priority = DMA_Priority_High;
    DMA_InitStructure.DMA_M2M = DMA_M2M_Disable;
    DMA_Init(DMA1_Channel5, &DMA_InitStructure);

    DMA_ITConfig(DMA1_Channel5, DMA_IT_TC, ENABLE);

    NVIC_InitTypeDef NVIC_InitStructure;
    NVIC_InitStructure.NVIC_IRQChannel = DMA1_Channel5_IRQn;
    NVIC_InitStructure.NVIC_IRQChannelCmd = ENABLE;
    NVIC_InitStructure.NVIC_IRQChannelPreemptionPriority = 2;  // 中等优先级（编码器DMA）
    NVIC_InitStructure.NVIC_IRQChannelSubPriority = 0;
    NVIC_Init(&NVIC_InitStructure);
}

static uint8_t MT6701_ReadRegPair(uint8_t reg, uint8_t *msb, uint8_t *lsb)
{
    uint32_t timeout;
    
    // 禁用TIM2中断，防止I2C事务被打断导致状态机损坏
    TIM_ITConfig(TIM2, TIM_IT_Update, DISABLE);
    
    timeout = 10000;
    // 等待总线空闲（带超时）
    while (I2C_GetFlagStatus(I2C2, I2C_FLAG_BUSY) && timeout > 0) 
    {
        timeout--;
    }
    
    if (timeout == 0) {
        // 总线卡死，软件复位I2C2
        I2C_SoftwareResetCmd(I2C2, ENABLE);
        I2C_SoftwareResetCmd(I2C2, DISABLE);
        
        I2C_InitTypeDef I2C_InitStructure;
        I2C_InitStructure.I2C_Mode = I2C_Mode_I2C;
        I2C_InitStructure.I2C_DutyCycle = I2C_DutyCycle_2;
        I2C_InitStructure.I2C_OwnAddress1 = 0x00;
        I2C_InitStructure.I2C_Ack = I2C_Ack_Enable;
        I2C_InitStructure.I2C_AcknowledgedAddress = I2C_AcknowledgedAddress_7bit;
        I2C_InitStructure.I2C_ClockSpeed = 400000;
        I2C_Init(I2C2, &I2C_InitStructure);
        I2C_Cmd(I2C2, ENABLE);
        TIM_ITConfig(TIM2, TIM_IT_Update, ENABLE);
        return 0;
    }

    I2C_GenerateSTART(I2C2, ENABLE);
    timeout = 10000;
    while (!I2C_CheckEvent(I2C2, I2C_EVENT_MASTER_MODE_SELECT) && timeout > 0) { timeout--; }

    I2C_Send7bitAddress(I2C2, MT6701_I2C_ADDR << 1, I2C_Direction_Transmitter);
    timeout = 10000;
    while (!I2C_CheckEvent(I2C2, I2C_EVENT_MASTER_TRANSMITTER_MODE_SELECTED) && timeout > 0) { timeout--; }

    I2C_SendData(I2C2, reg);
    timeout = 10000;
    while (!I2C_CheckEvent(I2C2, I2C_EVENT_MASTER_BYTE_TRANSMITTED) && timeout > 0) { timeout--; }

    I2C_GenerateSTART(I2C2, ENABLE);
    timeout = 10000;
    while (!I2C_CheckEvent(I2C2, I2C_EVENT_MASTER_MODE_SELECT) && timeout > 0) { timeout--; }

    I2C_Send7bitAddress(I2C2, MT6701_I2C_ADDR << 1, I2C_Direction_Receiver);
    timeout = 10000;
    while (!I2C_CheckEvent(I2C2, I2C_EVENT_MASTER_RECEIVER_MODE_SELECTED) && timeout > 0) { timeout--; }

    timeout = 10000;
    while (!I2C_CheckEvent(I2C2, I2C_EVENT_MASTER_BYTE_RECEIVED) && timeout > 0) { timeout--; }
    *msb = I2C_ReceiveData(I2C2);

    I2C_AcknowledgeConfig(I2C2, DISABLE);
    timeout = 10000;
    while (!I2C_CheckEvent(I2C2, I2C_EVENT_MASTER_BYTE_RECEIVED) && timeout > 0) { timeout--; }
    *lsb = I2C_ReceiveData(I2C2);

    I2C_GenerateSTOP(I2C2, ENABLE);
    I2C_AcknowledgeConfig(I2C2, ENABLE);

    // 恢复TIM2中断
    TIM_ITConfig(TIM2, TIM_IT_Update, ENABLE);

    return 1;
}

// 前向声明，使 Encoder_Init() 能调用
uint16_t Encoder_GetRaw14(void);

void Encoder_Init(void)
{
    RCC_APB2PeriphClockCmd(RCC_APB2Periph_GPIOB, ENABLE);
    RCC_APB1PeriphClockCmd(RCC_APB1Periph_I2C2, ENABLE);

    GPIO_InitTypeDef GPIO_InitStructure;
    GPIO_InitStructure.GPIO_Mode = GPIO_Mode_AF_OD;
    GPIO_InitStructure.GPIO_Speed = GPIO_Speed_50MHz;
    GPIO_InitStructure.GPIO_Pin = GPIO_Pin_10 | GPIO_Pin_11;
    GPIO_Init(GPIOB, &GPIO_InitStructure);

    I2C_InitTypeDef I2C_InitStructure;
    I2C_InitStructure.I2C_Mode = I2C_Mode_I2C;
    I2C_InitStructure.I2C_DutyCycle = I2C_DutyCycle_2;
    I2C_InitStructure.I2C_OwnAddress1 = 0x00;
    I2C_InitStructure.I2C_Ack = I2C_Ack_Enable;
    I2C_InitStructure.I2C_AcknowledgedAddress = I2C_AcknowledgedAddress_7bit;
    I2C_InitStructure.I2C_ClockSpeed = 400000;
    I2C_Init(I2C2, &I2C_InitStructure);

