ljun3498-oss/stm32/User/main.c
    I2C_Cmd(I2C2, ENABLE);

    g_ms = 0;
    g_last_raw = 0;
    g_accum = 0;
    g_last_speed_accum = 0;
    g_last_speed_time = 0;
    g_current_rpm = 0;
    g_buffer_index = 0;
    g_buffer_ready = 0;
    g_dma_active = 0;


    Encoder_TimeBaseInit();
    Encoder_DMA_Init();
    
    // 初始化编码器：预读多次以建立正确的g_last_raw基准
    // 如果编码器有连接，应该能读到不同的值
    Delay_ms(100);
    uint16_t init_val = Encoder_GetRaw14();  // 多读几次，确保I2C工作
    Delay_ms(20);
    init_val = Encoder_GetRaw14();
    Delay_ms(20);
    init_val = Encoder_GetRaw14();
    
    // 记录初始化值以供诊断，并设置初始显示值
    diag_init_val = init_val;
    diag_raw_value = init_val;
    diag_last_raw = init_val;
    
    // 设置基准
    g_last_raw = init_val;
    encoder_raw_cache = init_val;
    g_accum = (int32_t)init_val;
}

void Encoder_StartHighSpeedAcquisition(void)
{
    if (g_dma_active) return;

    g_buffer_index = 0;
    g_buffer_ready = 0;
    g_dma_active = 1;

    I2C_GenerateSTART(I2C2, ENABLE);
    while (!I2C_CheckEvent(I2C2, I2C_EVENT_MASTER_MODE_SELECT));

    I2C_Send7bitAddress(I2C2, MT6701_I2C_ADDR << 1, I2C_Direction_Transmitter);
    while (!I2C_CheckEvent(I2C2, I2C_EVENT_MASTER_TRANSMITTER_MODE_SELECTED));

    I2C_SendData(I2C2, MT6701_REG_ANGLE_MSB);
    while (!I2C_CheckEvent(I2C2, I2C_EVENT_MASTER_BYTE_TRANSMITTED));

    I2C_GenerateSTART(I2C2, ENABLE);
    while (!I2C_CheckEvent(I2C2, I2C_EVENT_MASTER_MODE_SELECT));

    I2C_Send7bitAddress(I2C2, MT6701_I2C_ADDR << 1, I2C_Direction_Receiver);
    while (!I2C_CheckEvent(I2C2, I2C_EVENT_MASTER_RECEIVER_MODE_SELECTED));

    I2C_DMALastTransferCmd(I2C2, ENABLE);
    I2C_DMACmd(I2C2, ENABLE);
    DMA_Cmd(DMA1_Channel5, ENABLE);
}

uint8_t Encoder_GetReadyBuffer(uint8_t **buffer, uint16_t *size)
{
    if (!g_buffer_ready) return 0;

    *buffer = g_ready_buffer;
    *size = g_buffer_index * 2;
    g_buffer_ready = 0;
    return 1;
}

void Encoder_ProcessBuffer(uint8_t *buffer, uint16_t size)
{
    uint16_t i;
    uint32_t now_ms = g_ms;
    uint32_t dt_ms = now_ms - g_last_speed_time;
    int32_t delta_accum;

    for (i = 0; i < size; i += 2)
    {
        uint16_t raw = (uint16_t)((buffer[i] << 8) | buffer[i + 1]) & 0x3FFF;
        int32_t delta = (int32_t)raw - (int32_t)g_last_raw;

        // 更新诊断变量（处理前的状态）
        diag_last_raw = g_last_raw;
        diag_raw_value = raw;

        if (delta > (MT6701_ELEC_COUNTS / 2))
        {
            delta -= MT6701_ELEC_COUNTS;
        }
        else if (delta < -(MT6701_ELEC_COUNTS / 2))
        {
            delta += MT6701_ELEC_COUNTS;
        }

        g_accum -= delta;  // 反向编码器，与Encoder_Get()保持一致
        g_last_raw = raw;
    }

    if (dt_ms > 0)
    {
        delta_accum = g_accum - g_last_speed_accum;
        g_current_rpm = (int16_t)((int64_t)delta_accum * 60000LL / (MT6701_MECH_COUNTS * (int32_t)dt_ms));
        g_last_speed_accum = g_accum;
        g_last_speed_time = now_ms;
    }
}

static void Encoder_UpdateSpeedFromAccum(void)
{
    uint32_t now_ms = g_ms;
    uint32_t dt_ms = now_ms - g_last_speed_time;
    int32_t delta_accum;

    if (dt_ms < 100)
    {
        return;  // 需要累计至少100ms才计算速度
    }

    delta_accum = g_accum - g_last_speed_accum;
    g_current_rpm = (int16_t)((int64_t)delta_accum * 60000LL / (MT6701_MECH_COUNTS * (int32_t)dt_ms));
    g_last_speed_accum = g_accum;
    g_last_speed_time = now_ms;
}

uint32_t Encoder_GetTimeMs(void)
{
    return g_ms;
}

uint16_t Encoder_GetRaw14(void)
{
    uint8_t msb = 0;
    uint8_t lsb = 0;

    if (!MT6701_ReadRegPair(MT6701_REG_ANGLE_MSB, &msb, &lsb))
    {
        // 读取失败，返回上一次成功的值而不是0
        return encoder_raw_cache;
    }

    uint16_t raw = (uint16_t)((msb << 8) | lsb) & 0x3FFF;
    encoder_raw_cache = raw;  // 缓存成功读取的值
    return raw;
}

int16_t Encoder_Get(void)
{
    uint16_t raw = Encoder_GetRaw14();
    int32_t delta = (int32_t)raw - (int32_t)g_last_raw;
    int32_t mod;
    uint16_t angle_tenths;

    // 诊断用：记录raw值和g_last_raw
    diag_raw_value = raw;
    diag_last_raw = g_last_raw;

    if (delta > (MT6701_ELEC_COUNTS / 2))
    {
        delta -= MT6701_ELEC_COUNTS;
    }
    else if (delta < -(MT6701_ELEC_COUNTS / 2))
    {
        delta += MT6701_ELEC_COUNTS;
    }

    g_accum -= delta;  // 反向编码器
    g_last_raw = raw;
    g_encoder_raw_for_foc = raw;  // 更新FOC用的原始值

    mod = g_accum % MT6701_MECH_COUNTS;
    if (mod < 0) mod += MT6701_MECH_COUNTS;

    angle_tenths = (uint16_t)((uint32_t)mod * 3600U / MT6701_MECH_COUNTS);
    return (int16_t)angle_tenths;
}

int16_t Encoder_GetSpeedRPM(void)
{
    return g_current_rpm;
}

// 编码器角度缓存（在主循环中更新，FOC中使用，避免中断中的I2C阻塞）

// 轴对齐补偿（存储d轴对齐时计算的角度偏移）

// OLED 显示标志位（在FOC中断中设置标志，主循环中显示）

// FOC运行标志位（初始关闭，按键启动）

// FOC状态机：0=正常运行，1=对齐中

/* ==================== FOC Module (Fixed-Point) ==================== */
// 定点数定义 Q15格式：1符号位+15小数位，范围[-1, 0.999969]

// 角度定义：uint16_t 0~65535 对应 0~2π

// FOC参数（根据实际调整）

// 清零FOC积分器（启动时调用）
void FOC_ResetIntegrators(void)
{
    Id_int_q15 = 0;
    Iq_int_q15 = 0;
}

// 启动FOC（从对齐模式开始，对齐完成后自动进入闭环）
void FOC_Start(void)
{
    FOC_ResetIntegrators();
    g_align_counter = 0;
    g_alignment_done = 0;
    g_iq_ref_q15 = 0;  // 默认无力矩，外部设置
    g_foc_state = FOC_STATE_ALIGN;
}

// 停止FOC
void FOC_Stop(void)
{
    g_foc_state = FOC_STATE_IDLE;
    TIM_SetCompare1(TIM2, 0);
    TIM_SetCompare2(TIM2, 0);
    TIM_SetCompare3(TIM2, 0);
}

// 快速Sin查表（带线性插值）
static int16_t fast_sin_q15(uint16_t angle)
{
    uint16_t index = angle >> 8;
    uint16_t frac = angle & 0xFF;
    int16_t s0 = sin_table[index];
    int16_t s1 = sin_table[(index + 1) & 0xFF];
    return s0 + (int16_t)(((int32_t)(s1 - s0) * frac) >> 8);
}

// 快速Cos查表
static int16_t fast_cos_q15(uint16_t angle)
{
    return fast_sin_q15(angle + 16384);
}

// 定点数限幅
static int16_t clamp_q15(int32_t val, int16_t min, int16_t max)
{
    if (val < min) return min;
    if (val > max) return max;
    return (int16_t)val;
}



// Clarke变换（两电流版，定点数版本）
// 输入：Q15格式电流，输出：Q15格式
void clarke_transform_q15(int16_t Ia_q15, int16_t Ib_q15, int16_t Ic_q15, int16_t *alpha, int16_t *beta)
{
    (void)Ic_q15;
    *alpha = Ia_q15;

    // Ibeta = (Ia + 2*Ib) / sqrt(3)
    int32_t temp = (int32_t)Ia_q15 + ((int32_t)Ib_q15 << 1);
    *beta = (int16_t)((temp * 18919L) >> 15);  // 18919 = (1/sqrt(3))*32768
}

