ljun3498-oss/stm32/User/main.c
// Park变换（定点数版本）
void park_transform_q15(int16_t alpha, int16_t beta, uint16_t theta, int16_t *d, int16_t *q)
{
    int16_t cos_t = fast_cos_q15(theta);
    int16_t sin_t = fast_sin_q15(theta);
    
    int32_t d_temp = Q15_MULT(alpha, cos_t) + Q15_MULT(beta, sin_t);
    int32_t q_temp = -Q15_MULT(alpha, sin_t) + Q15_MULT(beta, cos_t);
    
    *d = (int16_t)d_temp;
    *q = (int16_t)q_temp;
}

// 逆Park变换（定点数版本）
void inv_park_transform_q15(int16_t vd, int16_t vq, uint16_t theta, int16_t *alpha, int16_t *beta)
{
    int16_t cos_t = fast_cos_q15(theta);
    int16_t sin_t = fast_sin_q15(theta);
    
    int32_t alpha_temp = Q15_MULT(vd, cos_t) - Q15_MULT(vq, sin_t);
    int32_t beta_temp = Q15_MULT(vd, sin_t) + Q15_MULT(vq, cos_t);
    
    *alpha = (int16_t)alpha_temp;
    *beta = (int16_t)beta_temp;
}

// D轴电流PI控制器（定点数版本）
int16_t pi_id_q15(int16_t err_q15)
{
    int16_t Imax_q15 = (int16_t)(MAX_CURRENT_Q15 >> 0);  // 1.5A限制
    
    // 积分项：I += Ki * err * dt (dt=0.1ms)
    int32_t integral_increment = (Q15_MULT(KI_ID_Q15, err_q15) * 1) / 10;  // dt=0.1 -> *1/10
    Id_int_q15 += integral_increment;
    Id_int_q15 = clamp_q15(Id_int_q15, -Imax_q15, Imax_q15);
    
    int32_t output = Q15_MULT(KP_ID_Q15, err_q15) + (Id_int_q15 >> 0);
    return clamp_q15(output, -Imax_q15, Imax_q15);
}

// Q轴电流PI控制器（定点数版本）
int16_t pi_iq_q15(int16_t err_q15)
{
    int16_t Imax_q15 = (int16_t)(MAX_CURRENT_Q15 >> 0);  // 1.5A限制
    
    // 积分项：I += Ki * err * dt (dt=0.1ms)
    int32_t integral_increment = (Q15_MULT(KI_IQ_Q15, err_q15) * 1) / 10;  // dt=0.1 -> *1/10
    Iq_int_q15 += integral_increment;
    Iq_int_q15 = clamp_q15(Iq_int_q15, -Imax_q15, Imax_q15);
    
    int32_t output = Q15_MULT(KP_IQ_Q15, err_q15) + (Iq_int_q15 >> 0);
    return clamp_q15(output, -Imax_q15, Imax_q15);
}

// SVPWM计算函数（定点数版本）
void svpwm_compute_q15(int16_t Valpha_q15, int16_t Vbeta_q15, uint16_t *ccr1, uint16_t *ccr2, uint16_t *ccr3)
{
    // 1. αβ → 三相（逆Clarke）
    int32_t Va = Valpha_q15;
    int32_t Vb = -((int32_t)Valpha_q15 >> 1) + Q15_MULT(Vbeta_q15, 28378);  // 28378 = 0.866*32768
    int32_t Vc = -((int32_t)Valpha_q15 >> 1) - Q15_MULT(Vbeta_q15, 28378);
    
    // 2. 零序电压注入
    int32_t Vmax = Va;
    if (Vb > Vmax) Vmax = Vb;
    if (Vc > Vmax) Vmax = Vc;
    
    int32_t Vmin = Va;
    if (Vb < Vmin) Vmin = Vb;
    if (Vc < Vmin) Vmin = Vc;
    
    int32_t Voffset = -(Vmax + Vmin) >> 1;
    
    Va += Voffset;
    Vb += Voffset;
    Vc += Voffset;
    
    // 3. 转换为PWM占空比（考虑母线电压：12V）
    // Q15格式±6V范围 → PWM占空比0~1800
    // 关键修复：电压缩放正确对应母线电压，防止过调制
    uint16_t half_period = PWM_PERIOD_TICKS >> 1;
    int32_t k = (int32_t)half_period;  // 900，PWM周期的一半，对应满幅度
    
    int32_t Ta = half_period + ((Va * k) >> 15);
    int32_t Tb = half_period + ((Vb * k) >> 15);
    int32_t Tc = half_period + ((Vc * k) >> 15);
    
    // 4. 安全限幅
    if (Ta < 0) Ta = 0;
    if (Tb < 0) Tb = 0;
    if (Tc < 0) Tc = 0;
    
    if (Ta > PWM_PERIOD_TICKS) Ta = PWM_PERIOD_TICKS;
    if (Tb > PWM_PERIOD_TICKS) Tb = PWM_PERIOD_TICKS;
    if (Tc > PWM_PERIOD_TICKS) Tc = PWM_PERIOD_TICKS;
    
    *ccr1 = (uint16_t)Ta;
    *ccr2 = (uint16_t)Tb;
    *ccr3 = (uint16_t)Tc;
}

// 传感器数据采集函数：在TIM3中断中调用（10kHz）
// 电流采集已移至TIM2 FOC中断
static void SensorData_Collect(void)
{
    // 电流在TIM2 FOC中断中读取，此处无需重复采集
}

// TIM3中断处理函数（10kHz触发，用于传感器数据采集）
void TIM3_IRQHandler(void)
{
    if (TIM_GetITStatus(TIM3, TIM_IT_Update) == SET)
    {
        // 采集传感器数据
        SensorData_Collect();
        
        // 每100次中断设置一次OLED更新标志（100Hz刷新）10kHz/100）
        display_counter++;
        if (display_counter >= 100)
        {
            display_counter = 0;
            g_oled_update_flag = 1;  // 通知主循环更新显示
        }
        
        TIM_ClearITPendingBit(TIM3, TIM_IT_Update);
    }
}

// TIM2中断处理函数（最高优先级，FOC控制环 @ 20kHz）
void TIM2_IRQHandler(void)
{
    if (TIM_GetITStatus(TIM2, TIM_IT_Update) == SET)
    {
        TIM_ClearITPendingBit(TIM2, TIM_IT_Update);
        
        // 中心对齐模式下更新中断触发频率是PWM频率的2倍(40kHz)
        // 跳过一半，实际FOC频率为20kHz
        static uint8_t foc_skip = 0;
        foc_skip ^= 1;
        if (foc_skip) return;
        
        // 读取三相电流（无论FOC状态，用于显示）
        g_Ia_mA = (int16_t)DMAAD_AdcToCurrent_mA(AD_Value[0], 0);
        g_Ib_mA = (int16_t)DMAAD_AdcToCurrent_mA(AD_Value[1], 1);
        g_Ic_mA = (int16_t)DMAAD_AdcToCurrent_mA(AD_Value[2], 2);
        
        /* ---- 状态机：空闲 ---- */
        if (g_foc_state == FOC_STATE_IDLE)
        {
            TIM_SetCompare1(TIM2, 0);
            TIM_SetCompare2(TIM2, 0);
            TIM_SetCompare3(TIM2, 0);
            return;
        }
        
        /* ---- 状态机：对齐模式 ---- */
        if (g_foc_state == FOC_STATE_ALIGN)
        {
            // 施加d轴电压，将转子锁定到电角度0位置
            int16_t Valpha, Vbeta;
            uint16_t ccr1, ccr2, ccr3;
            
            // Vd=3000(~9%), Vq=0, theta=0 → 锁定到A相
            inv_park_transform_q15(3000, 0, 0, &Valpha, &Vbeta);
            svpwm_compute_q15(Valpha, Vbeta, &ccr1, &ccr2, &ccr3);
            
            TIM_SetCompare1(TIM2, ccr1);
            TIM_SetCompare2(TIM2, ccr2);
            TIM_SetCompare3(TIM2, ccr3);
            
            g_align_counter++;
            if (g_align_counter >= 20000U)  // 1秒对齐 (20kHz × 1s)
            {
                // 用编码器原始值计算电角度偏移（不受传动比影响）
                uint32_t raw14 = g_encoder_raw_for_foc;
                uint32_t elec_angle = (raw14 * MT6701_POLE_PAIRS) % MT6701_ELEC_COUNTS;
                g_elec_offset_q16 = -(int16_t)((elec_angle * 65536UL) / MT6701_ELEC_COUNTS);
                
                // 开环电角度从当前偏移开始
                g_open_loop_theta = 0;  // 对齐后 theta=0 结合 offset 已经正确
                
                FOC_ResetIntegrators();
                g_alignment_done = 1;
                g_foc_state = FOC_STATE_CLOSEDLOOP;  // 直接进入闭环
            }
            return;
        }
        
        /* ---- 状态机：开环模式 ---- */
        if (g_foc_state == FOC_STATE_OPENLOOP)
        {
            // 软件步进电角度，不依赖电流反馈
            // 步进速度：5 / 20000 * 65536 ≈ 1.5Hz电频率
            // 对应机械转速 = 1.5/7 ≈ 13 rpm（很慢，确保跟得上）
            g_open_loop_theta += OPEN_LOOP_STEP_Q16;  // 使用宏定义的步进值 (Q16格式)
            
            int16_t Valpha, Vbeta;
            uint16_t ccr1, ccr2, ccr3;
            
            // Vd=0, Vq=OPEN_LOOP_VQ_Q15 — q轴施加电压驱动转子旋转
            inv_park_transform_q15(0, OPEN_LOOP_VQ_Q15, g_open_loop_theta, &Valpha, &Vbeta);
            svpwm_compute_q15(Valpha, Vbeta, &ccr1, &ccr2, &ccr3);
            
            TIM_SetCompare1(TIM2, ccr1);
            TIM_SetCompare2(TIM2, ccr2);
            TIM_SetCompare3(TIM2, ccr3);
            return;
        }
        
        /* ---- 状态机：闭环FOC模式 ---- */
        if (g_foc_state == FOC_STATE_CLOSEDLOOP)
        {
            // 1. 用编码器原始值计算电角度（不受传动比影响）
            uint32_t raw14 = g_encoder_raw_for_foc;
            uint32_t elec_angle = (raw14 * MT6701_POLE_PAIRS) % MT6701_ELEC_COUNTS;
            uint16_t theta = (uint16_t)((elec_angle * 65536UL) / MT6701_ELEC_COUNTS);
            theta = (uint16_t)((int32_t)theta + g_elec_offset_q16);
            
            if (g_theta_flip) theta = (uint16_t)(-(int16_t)theta);
            
            // 2. 电流转Q15格式 (±1500mA → ±32767)
            int16_t Ia_q15 = (int16_t)((int32_t)g_Ia_mA * MAX_CURRENT_Q15 / MAX_CURRENT_MA);
            int16_t Ib_q15 = (int16_t)((int32_t)g_Ib_mA * MAX_CURRENT_Q15 / MAX_CURRENT_MA);
            int16_t Ic_q15 = (int16_t)((int32_t)g_Ic_mA * MAX_CURRENT_Q15 / MAX_CURRENT_MA);
            
            // 3. Clarke变换: Ia,Ib,Ic → Iα,Iβ
            int16_t Ialpha, Ibeta;
            clarke_transform_q15(Ia_q15, Ib_q15, Ic_q15, &Ialpha, &Ibeta);
            
            // 4. Park变换: Iα,Iβ → Id,Iq
            int16_t Id, Iq;
            park_transform_q15(Ialpha, Ibeta, theta, &Id, &Iq);
            
            // 5. PI控制器 (Id_ref=0, Iq_ref=g_iq_ref_q15)
            int16_t Vd = pi_id_q15(0 - Id);
            int16_t Vq = pi_iq_q15(g_iq_ref_q15 - Iq);
            
            // 6. 电压限幅
            Vd = clamp_q15(Vd, -VOLT_MAX_Q15, VOLT_MAX_Q15);
            Vq = clamp_q15(Vq, -VOLT_MAX_Q15, VOLT_MAX_Q15);
            
            // 7. 逆Park变换: Vd,Vq → Vα,Vβ
            int16_t Valpha, Vbeta;
            inv_park_transform_q15(Vd, Vq, theta, &Valpha, &Vbeta);
            
            // 8. SVPWM输出
            uint16_t ccr1, ccr2, ccr3;
            svpwm_compute_q15(Valpha, Vbeta, &ccr1, &ccr2, &ccr3);
            
            TIM_SetCompare1(TIM2, ccr1);
            TIM_SetCompare2(TIM2, ccr2);
            TIM_SetCompare3(TIM2, ccr3);
        }
    }
}

