ljun3498-oss/stm32/User/main.c
/* ==================== Key Module (PB13) ==================== */

static void Key_Init(void)
{
    RCC_APB2PeriphClockCmd(RCC_APB2Periph_GPIOB, ENABLE);
    
    GPIO_InitTypeDef GPIO_InitStructure;
    GPIO_InitStructure.GPIO_Mode = GPIO_Mode_IPD;  // 下拉输入，按下为高
    GPIO_InitStructure.GPIO_Pin = GPIO_Pin_13;
    GPIO_InitStructure.GPIO_Speed = GPIO_Speed_50MHz;
    GPIO_Init(GPIOB, &GPIO_InitStructure);
}

// 返回1表示按键按下（带消抖），0表示未按下
static uint8_t Key_Pressed(void)
{
    static uint8_t last_state = 0;  // 下拉，默认低
    uint8_t curr = GPIO_ReadInputDataBit(GPIOB, GPIO_Pin_13);
    
    if (last_state == 0 && curr == 1)  // 上升沿（按下）
    {
        Delay_ms(20);  // 消抖
        curr = GPIO_ReadInputDataBit(GPIOB, GPIO_Pin_13);
        if (curr == 1)
        {
            last_state = 1;
            return 1;  // 确认按下
        }
    }
    else if (curr == 0)
    {
        last_state = 0;  // 松手复位
    }
    return 0;
}

/* ==================== Main ==================== */
int main(void)
{
    // 配置NVIC中断优先级分组（2位抢占，2位子优先级）
    NVIC_PriorityGroupConfig(NVIC_PriorityGroup_2);
    
    OLED_Init();
    OLED_Clear();
    
    // 立即显示测试信息
    OLED_ShowString(1, 1, "Step 1: OLED OK ");
    Delay_ms(500);
    
    PWM_Init();
    OLED_ShowString(2, 1, "Step 2: PWM OK  ");
    Delay_ms(500);
    
    OLED_ShowString(3, 1, "Step 3: ADC...  ");
    DMAAD_Init();
    OLED_ShowString(3, 1, "Step 3: ADC OK  ");
    Delay_ms(500);
    
    OLED_ShowString(4, 1, "Step 4: ENC...  ");
    Encoder_Init();
    OLED_ShowString(4, 1, "Step 4: ENC OK  ");
    Delay_ms(500);
    
    // 暂时不启动DMA，使用简单的I2C轮询
    // Encoder_StartHighSpeedAcquisition();
    
    OLED_Clear();
    // ADC零点校准（电机静止时运行）
    OLED_ShowString(1, 1, "Calibrating...  ");
    DMAAD_CalibrateZeroPoint();
    
    // 显示初始屏幕
    OLED_ShowString(1, 1, "Ang:   Spd:     ");
    OLED_ShowString(2, 1, "Ia:          mA ");
    OLED_ShowString(3, 1, "Ib:          mA ");
    OLED_ShowString(4, 1, "Ic:          mA ");
    
    // 初始化按键
    Key_Init();
    
    // 启用TIM3中断，开始采集传感器数据
    TIM_ITConfig(TIM3, TIM_IT_Update, ENABLE);
    Delay_ms(100);
    
    // 默认不启动FOC，等待按键
    // FOC状态已在变量初始化中设为IDLE

    while (1)
    {
        // 按键检测：切换FOC启停
        if (Key_Pressed())
        {
            if (g_foc_state == FOC_STATE_IDLE)
            {
                FOC_Start();  // 启动FOC（对齐→闭环）
            }
            else
            {
                FOC_Stop();   // 停止FOC，PWM归零
            }
        }
        
        // 使用简单的I2C轮询模式（不用DMA）
        int16_t angle_signed = Encoder_Get();
        uint16_t mech_angle_tenths = (uint16_t)angle_signed;
        g_cached_angle_tenths = mech_angle_tenths;
        Encoder_UpdateSpeedFromAccum();
        
        // 只在OLED更新标志设置时才刷新屏幕
        if (g_oled_update_flag)
        {
            g_oled_update_flag = 0;
            
            // 计算显示数据
            uint16_t angle_deg = g_cached_angle_tenths / 10;
            int16_t speed_rpm_signed = Encoder_GetSpeedRPM();
            char speed_sign = speed_rpm_signed < 0 ? '-' : '+';
            uint16_t speed_rpm = (uint16_t)(speed_rpm_signed < 0 ? -speed_rpm_signed : speed_rpm_signed);
            
            // 第1行：角度、速度
            OLED_ShowNum(1, 5, angle_deg, 3);
            OLED_ShowChar(1, 9, speed_sign);
            OLED_ShowNum(1, 11, speed_rpm, 4);
            
            // 第2行：Ia电流
            char ia_sign = g_Ia_mA < 0 ? '-' : '+';
            uint16_t ia_abs = (uint16_t)(g_Ia_mA < 0 ? -g_Ia_mA : g_Ia_mA);
            OLED_ShowChar(2, 4, ia_sign);
            OLED_ShowNum(2, 5, ia_abs, 5);
            
            // 第3行：Ib电流
            char ib_sign = g_Ib_mA < 0 ? '-' : '+';
            uint16_t ib_abs = (uint16_t)(g_Ib_mA < 0 ? -g_Ib_mA : g_Ib_mA);
            OLED_ShowChar(3, 4, ib_sign);
            OLED_ShowNum(3, 5, ib_abs, 5);
            
            // 第4行：Ic电流
            char ic_sign = g_Ic_mA < 0 ? '-' : '+';
            uint16_t ic_abs = (uint16_t)(g_Ic_mA < 0 ? -g_Ic_mA : g_Ic_mA);
            OLED_ShowChar(4, 4, ic_sign);
            OLED_ShowNum(4, 5, ic_abs, 5);
        }
    }
}

